#1)გააკეთეთ ყველა იმ შედარების ოპერატორზე 3-3 მაგალითი რაც ვისწავლეთ...

#2)მომხმარებელს შემოატანინეთ მისი საყვარელი რიცხვი და გაიგეთ უდრის თუ არა მისი საყვარელი რიცხვი თქვენს საყვარელ რიცხვს.

#3)True or False and 5 > 3 or "name" == "name" and 123 == "123" and 5 >= 5 <--- გაიგეთ რას გამოიტანს ეს კოდი და ახსენით რატომ.

#4)მომხმარებელს შემოატანინეთ მისი ასაკი და მისი გვარი და შეამოწმეთ თუ ასაკი მეტი ან ტოლი იქნება 18ის ან მისი გვარი ტოლი იქნება 
#თქვენი გვარის.

#5)ახსენით რა არის ალგორითმი (მოიყვანეთ რეალური ცხოვრების 3 მაგალითი).

#6)ახსენით თითოეული ის ალგორითმის გამოსახვის ტექნიკა რაც ვისწავლეთ.

#7)ახსენით control flow-ს ის სამი ტექტინა რომელიც გავიარეთ.

#8)მომხმარებელს შემოატანინეთ 5 რიცხვი, დაითვალეთ მათი საშუალო არითმეტიკული და გაიგეთ თუ მათი საშუალო არითმეტიკული ნაკლები 
#იქენება პირველი და ბოლო რიცხვის ნამრავლზე.