#1)შექმენით სია, რომელშიც მოცემულია კვირის დღეები:["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"].
#ამოიღეთ და დაბეჭდეთ: კვირის პირველი დღე.ბოლო დღე.
#შეცვალეთ სიის მესამე ელემენტი ("Wednesday") ახალ მნიშვნელობაზე "Midweek".

#2)მომხმარებელს სთხოვეთ, რომ შეიყვანოს ხუთი საყვარელი ცხოველის სახელები. სახელები შეინახეთ სიაში.
#მომხმარებლის მიერ შეყვანილი სიის მიხედვით:დაბეჭდეთ პირველი და ბოლო ცხოველის სახელი.შეცვალეთ სიის მეორე ცხოველის სახელი და 
#მომხმარებლისგან მოითხოვეთ ახალი მნიშვნელობა.დაბეჭდეთ განახლებული სია.

#3)შექმენით სია: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12].
#ამოიღეთ სიის ყოველი მესამე ელემენტი. ამოიღეთ სია უკუღმა. სიის შუა 6 ელემენტი გადაიტანეთ ახალ სიაში.

#4)შექმენით სია, რომელიც შეიცავს ათასიდან ათიათასამდე ყველა რიცხვს, რომლებიც იყოფა 500-ზე.
#გამოიყენეთ სლაისინგი, რათა ამოიღოთ:პირველი ხუთი რიცხვი.ყოველი მესამე რიცხვი.დაითვალეთ, რამდენი ელემენტია საბოლოო სიაში.

#5)მომხმარებელს სთხოვეთ, რომ შეიყვანოს 10 რიცხვი მძიმით გამოყოფილად. შეინახეთ ეს რიცხვები სიაში.
#ამ სიის მიხედვით:ამოიღეთ და დაბეჭდეთ მომხმარებლის შეყვანილი პირველი სამი რიცხვი.სიის შუა ოთხი ელემენტი გადააკოპირეთ ახალ სიაში 
#და დაბეჭდეთ ის.შეამოწმეთ, თუ სიის ბოლო ელემენტი არის ციფრი 10.