#1)მომხმარებელს შემოატანინეთ რაღაც რიცხვი და შემდეგ შეამოწმეთ თუ ეს რიცხვი არის ლუწი,დაბეჭდეთ "even", ხოლო თუ კენტია "odd"

#2)(გაიხსენეთ for ციკლი) for loop ის საშუალებით დაბეჭდეთ 1 დან 50მდე ყველა ლუწი რიცხვი

#3)შექმენით სია შემდგარი რიცხვებისგან, გადაუარეთ for ციკლით და გამოიტანეთ მხოლოდ ის რიცხვები რომელიც მეტია 10ზე

#4)შექმენით  სია,რომელიც შედგება 10 რიცხვისგან  და შემდეგ დაბეჭდეთ პირველი და ბოლო ელემენტის სხვაობა,ჯამი,ნამრავლი

#5)(რთული)მომხმარებელს შემოატანინეთ რიცხვი და შეინახეთ ეს როცხვი ცვლადში, შემდეგ კი შექმენით სია რომელიც შედგება 5 სახელისგან,შემდეგ 
#გამოიტანეთ შემოტანილი რიცხვის ინდექსზე მდგომი სიის ელემენტი.