# გააკეთეთ ხუთ ხუთი მაგალითი ყველა გავლილ მათემატიკურ ოპერატორზე.
print(5 + 5)
print(10 + 10)
print(3 + 3)
print(7 + 7)
print(15 + 15)

print(10 - 2)
print(8 - 4)
print(5 - 1)
print(17 - 7)
print(9 - 3)

print(9 * 9)
print(5 * 5)
print(9 * 3)
print(12 * 7)
print(5 * 1)

print(4 / 2)
print(9 / 3)
print(15 / 3)
print(20 /10)
print(6 / 2)

# შექმენით ცვლადი age და მნიშვნელობად გადაეცით თქვენი ასაკი, შექმენით ახალი ცვლადი სადაც იქნება თქვენი ასაკი 5 წლის შემდეგ, ბოლოს კი გამოიტანეთ ეს ცვლადი.
age=15
age1=15 + 5
print(age,age1)

# თქვენი ოჯახის წევრების ასაკები შეინახეთ ცვლადებში და დაითვალეთ ყველა ასაკის ჯამი.
age=15, 17, 47, 49
print(15+17+47+49)

# შექმენით ცვლადი name რომელშიც შეინახავთ თქვენ სახელს და შემდეგ განაახლეთ ამ ცვლადის მნიშვნელობა და ჩაწერეთ თქვენი მეგობრის სახელი, საბოლოოდ დაბეჭდეთ name ცვლადი
name="tamari"
name="barbare"
print(name)