# 1)მომხმარებელს შემოატანინეთ მისი ასაკი და გაიგეთ რამდენჯერ მოთავსდება შიგნით 10იანი
age = "15"
print(int(age) + 10)

# 2)მომხმარებელს შემოატანინეთ მისი ასაკი, გაიგეთ ამ ასაკის მონაცემთა ტიპი, შემდეგ გადაიყვანეთ კილად რიცხვად და ისევ დაბეჭდეთ ამ ასაკის მონაცემთა ტიპი
age = int(input("15"))
print(type(age))

age2 = float(age)
print(type(age2))

# 3)მომხმარებელს შემოატანინეთ მისი სახელი, შემდეგ შემოატანინეთ რაღაც რიცხვი და გამოუტანეთ მისი სახელი გამრავლებული ამ რიცხვზე
name = input("tamar")
number = int(input("19"))
print(name * number)