#1)მომხმარებელს შემოატანინეთ თავისი ასაკი და დაუბეჭდეთ, რამდენი წლის იქნება 10 წელში, შემდეგ ეს შედეგი შეინახეთ ცვლადში 
#და გადაიყვანეთ float მონაცემთა ტიპად, საბოლოოდ შეამოწმეთ მისი type

#2)მომხმარებელს შემოატანინეთ მისი გვარი და დაუბეჭდეთ ეს გვარი 100ჯერ გადაბმულად

#3)შექმენი რეალური 5 სიტყვა, კონკატინაციის მეშვეობით

#4)კომენტარის სახით ახსენით, რისთვის გვჭირდება და ვიყენებთ სხვადასხვა მონაცემთა ტიპებს

#5)შექმენით 4 ცვლადი და შეინახეთ განსხვავებული მონაცემთა ტიპის მქონდა მნიშვნელობები, შემდეგ სათითაოდ დაბეჭდეთ მათი type