#1
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

start = int(input("შემოიტანეთ დასაწყისი ინდექსი: "))
end = int(input("შემოიტანეთ დასრულების ინდექსი: "))

print("მოცემული დიაპაზონის ელემენტები:", my_list[start:end+1])

#2
my_list = ["ა", "ბ", "გ", "დ", "ე"]

index = int(input("შემოიტანეთ ინდექსი (0-დან 4-მდე): "))

print("სიის ელემენტი მითითებულ ინდექსზე არის:", my_list[index])

#3
user_name = input("შემოიტანეთ თქვენი სახელი: ")

my_name = "tamari"

result = user_name[:3] + my_name[-2:]
print("შედეგი არის:", result)

#4
#Indexing: ინდექსის გამოყენება საშუალებას გაძლევთ აირჩიოთ მხოლოდ ერთი ელემენტი სიიდან ან სტრინგიდან. მაგალითად, my_list[0] გამოიტანს სიის პირველ ელემენტს.

#Slicing: გამოიყენება სიის ან სტრინგის ნაწილების (ქვეკარების) გამოსაყოფად. მაგალითად, my_list[1:4] გამოიტანს სიის 1-დან 3-მდე ელემენტებს.

#5
last_name = input("შემოიტანეთ თქვენი გვარი: ")

reversed_last_name = last_name[::-1]

print("თქვენი გვარი:", last_name)
print("თქვენი შებრუნებული გვარი:", reversed_last_name)
