#0)კომენტარის სახით ახსენით append/insert/pop/len/upper/lower/capitalize/find და დაწერეთ ინფორმაცია მათი არგუმენტების შესახებ

#1)შექმენით სია, შეიყვანეთ 5 გვარი, შემდეგ მომხმარებელს შემოატანინეთ მისი სახელი, თუ სახელი შეიცავს 7-ზე მეტ სიმბოლოს მაშინ ჩაამატეთ 
#სახელების სიაში

#2)შექმენით სია 10 ელემენტით და გამოიტანეთ მხოლოდ ლუწ ინდექსზე მდგომი ელემენტები.

#3)შექმენით ცვლადი რომელშიც შენახული იქნება სტრინგი შემდეგ კი გაიგეთ ამ სტრინგის სიმბოლოების რაოდენობა.

#4) მომხმარებელს შემოატანინეთ მისი სახელი დიდი ასოებით და შეინახეთ ცვლადში სახელად name და .lower() ფუნქციის მეშვეობით გადააქციეთ 
#ცვლადის მნიშვნელობა  პატარა ასოებად. 

#5) ცვლადში შეინახეთ თქვენი გვარი პატარა ასოებით, შემდეგ .upper() ფუნქციის მეშვეობით გადააქციეთ ცვლადის მნიშვნელობა  დიდ ასოებად.

#6) ცვლადში შეინახეთ სტრინგი პატარა ასოებით, შემდეგ .capitalize() ფუნქციის მეშვეობით გადააქციე პირველი ასო დიდ ასოდ.