#1)მომხმარებელს შემოატანინეთ რაღაც რიცხვი და შემდეგ შეამოწმეთ თუ ეს რიცხვი არის ლუწი,დაბეჭდეთ "even", ხოლო თუ კენტია "odd".
number = int(input("შეიყვანეთ რიცხვი: "))

if number % 2 == 0:
    print("even")
else:
    print("odd")
#2)(გაიხსენეთ for ციკლი) for loop ის საშუალებით დაბეჭდეთ 1 დან 50მდე ყველა ლუწი რიცხვი.
for i in range(0, 51, 2):
    print(i)
#3)შექმენით სია შემდგარი რიცხვებისგან, გადაუარეთ for ციკლით და გამოიტანეთ მხოლოდ ის რიცხვები რომელიც მეტია 10ზე.
result = 1

for i in range(1, 11):  
    result *= i 
print(result)
#4)შექმენით  სია,რომელიც შედგება 10 რიცხვისგან  და შემდეგ დაბეჭდეთ პირველი და ბოლო ელემენტის სხვაობა,ჯამი,ნამრავლი.
numbers = [10, 23, 45, 60, 100, 7]  
sum_divisible_by_10 = sum(num for num in numbers if num % 10 == 0)  
print(sum_divisible_by_10)

#5)(რთული)მომხმარებელს შემოატანინეთ რიცხვი და შეინახეთ ეს როცხვი ცვლადში, შემდეგ კი შექმენით სია რომელიც შედგება 
#5 სახელისგან,შემდეგ გამოიტანეთ შემოტანილი რიცხვის ინდექსზე მდგომი სიის ელემენტი.
number = int(input("შეიყვანეთ რიცხვი: "))

names = ["გვანცა", "ბარბარე", "მარი", "ლუკა", "თამარი"]

if 0 <= number < len(names):
    print(f"სიის {number} ინდექსზე არსებული ელემენტია: {names[number]}")
else:
    print("რიცხვი სიის ინდექსის ფარგლებს გარეთაა.")
